## Lecture : Pandas 101
In this lecture, we explore the python pandas library to connect to different types of data and perform basic data wrangling and transformation. To install pandas on anaconda run the following command at the anaconda prompt

***conda install pandas***

More information on pandas can be obtained on [link](https://pandas.pydata.org/pandas-docs/stable/)

### To import pandas library

In [2]:
import pandas as pd

## Connecting to data files
We can use pandas to connect to different types of file such as CSV, Excel, JSON, etc. Most of the times when we use pandas to connect to a data file, we are returned a pandas DataFrame object. Let us see some of the examples.

### Connect with csv file

In [3]:
csvdata = pd.read_csv("Online Retail.csv")# here delimiter argument is optional

In [4]:
type(csvdata)

pandas.core.frame.DataFrame

In [6]:
csvdata.head(2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [7]:
csvdata.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

### Connect with excel file

In [8]:
exceldata = pd.read_excel("Online Retail.xlsx")

### understand the type of data returned by pandas

In [9]:
print("Type of csvdata is {}".format(type(csvdata)))
print("Type of exceldata is {}".format(type(exceldata)))

Type of csvdata is <class 'pandas.core.frame.DataFrame'>
Type of exceldata is <class 'pandas.core.frame.DataFrame'>

### look at the basic information of the data
The pandas object returned has many functions associated with it. These can be called using the object name followed by dot (.) operator and then the function name.

In [9]:
csvdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  object
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [16]:
csvdata.shape

(541909, 8)

In [10]:
csvdata.columns = ['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomeID', 'Country']

In [11]:
csvdata.describe()

            Quantity      UnitPrice      CustomeID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [12]:
csvdata['InvoiceDate'] =  pd.to_datetime(csvdata['InvoiceDate'])

In [13]:
print("Calling the info function")
print(csvdata.info())
print("\n\nCalling the describe function")
print(csvdata.describe())
print("\n\n",csvdata.shape)

Calling the info function
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomeID    406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB
None


Calling the describe function
            Quantity      UnitPrice      CustomeID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000


 (541909, 8)

In [14]:
country = csvdata.Country.copy()

In [15]:
x = list(set(country))

In [16]:
x.count('Lithuania')

1

In [17]:
y = list(country)

In [18]:
y.count('Lithuania')

35

In [19]:
{ c:y.count(c) for c in x}

{'Lebanon': 45,
 'Portugal': 1519,
 'Australia': 1259,
 'Germany': 9495,
 'European Community': 61,
 'Italy': 803,
 'United Arab Emirates': 68,
 'Czech Republic': 30,
 'Channel Islands': 758,
 'Japan': 358,
 'Sweden': 462,
 'Austria': 401,
 'Switzerland': 2002,
 'Finland': 695,
 'Canada': 151,
 'Malta': 127,
 'EIRE': 8196,
 'Bahrain': 19,
 'Unspecified': 446,
 'Greece': 146,
 'USA': 291,
 'RSA': 58,
 'Belgium': 2069,
 'Lithuania': 35,
 'Israel': 297,
 'United Kingdom': 495478,
 'Singapore': 229,
 'Brazil': 32,
 'Denmark': 389,
 'Hong Kong': 288,
 'Norway': 1086,
 'Iceland': 182,
 'France': 8557,
 'Spain': 2533,
 'Saudi Arabia': 10,
 'Netherlands': 2371,
 'Cyprus': 622,
 'Poland': 341}

In [20]:
csvdata.Country.value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [21]:
csvdata.CustomeID = csvdata.CustomeID.astype('str')

In [22]:
print(type(country))

<class 'pandas.core.series.Series'>

In [23]:
set(list(country))

{'Australia',
 'Austria',
 'Bahrain',
 'Belgium',
 'Brazil',
 'Canada',
 'Channel Islands',
 'Cyprus',
 'Czech Republic',
 'Denmark',
 'EIRE',
 'European Community',
 'Finland',
 'France',
 'Germany',
 'Greece',
 'Hong Kong',
 'Iceland',
 'Israel',
 'Italy',
 'Japan',
 'Lebanon',
 'Lithuania',
 'Malta',
 'Netherlands',
 'Norway',
 'Poland',
 'Portugal',
 'RSA',
 'Saudi Arabia',
 'Singapore',
 'Spain',
 'Sweden',
 'Switzerland',
 'USA',
 'United Arab Emirates',
 'United Kingdom',
 'Unspecified'}

In [9]:
cols = ['Quantity','UnitPrice']

In [10]:
country = csvdata['Country'].copy()

In [11]:
sales = csvdata[cols].copy()
sales.head(11)

    Quantity  UnitPrice
0          6       2.55
1          6       3.39
2          8       2.75
3          6       3.39
4          6       3.39
5          2       7.65
6          6       4.25
7          6       1.85
8          6       1.85
9         32       1.69
10         6       2.10

In [12]:
sales['Revenue'] = sales['Quantity'] * sales['UnitPrice']*75
sales

        Quantity  UnitPrice  Revenue
0              6       2.55  1147.50
1              6       3.39  1525.50
2              8       2.75  1650.00
3              6       3.39  1525.50
4              6       3.39  1525.50
...          ...        ...      ...
541904        12       0.85   765.00
541905         6       2.10   945.00
541906         4       4.15  1245.00
541907         4       4.15  1245.00
541908         3       4.95  1113.75

[541909 rows x 3 columns]

In [29]:
sales.tail()

        Quantity  UnitPrice
541904        12       0.85
541905         6       2.10
541906         4       4.15
541907         4       4.15
541908         3       4.95

In [31]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Quantity   541909 non-null  int64
 1   UnitPrice  541909 non-null  float64
 2   Revenue    541909 non-null  float64
dtypes: float64(2), int64(1)
memory usage: 12.4 MB

In [35]:
sales.head()

   Quantity  UnitPrice  Revenue  RevenueFlag
0         6       2.55   1147.5        False
1         6       3.39   1525.5         True
2         8       2.75   1650.0         True
3         6       3.39   1525.5         True
4         6       3.39   1525.5         True

In [34]:
sales['RevenueFlag'] = sales.Revenue > sales.Revenue.mean()

In [36]:
totalrevenue = sum(sales.Revenue)
print(totalrevenue)

731081095.05

In [37]:
num_obs =sales.shape[0]

In [38]:
avgrevenue = totalrevenue / num_obs
print(avgrevenue)

1349.0846157749731

In [39]:
import numpy as np

In [40]:
np.mean(sales.Revenue)

1349.0846157749731

i'll get revenue
create  a new list for 1s n 0s
assign list back as a column

In [29]:
revenue = sales.Revenueenue

In [30]:
check=[]

In [31]:
for value in revenue:
    if(value > avgrevenue):
        check.append(1)
    else:
        check.append(0)

In [34]:
sales['AboveAverage'] = check
sales.head(5)

   Quantity  UnitPrice  Revenue  AboveAverage
0         6       2.55    15.30             0
1         6       3.39    20.34             1
2         8       2.75    22.00             1
3         6       3.39    20.34             1
4         6       3.39    20.34             1

### Look at the top / bottom 'n' rows
To look at the top 'n' rows, we use the pandas data frame function head() and pass the value 'n' as argument. Similarly, to look at the last 'n' rows, we use the tail() function and pass the value 'n' as argument.

In [41]:
print("Top 5 rows are as follows")
csvdata.head(5)

Top 5 rows are as follows

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomeID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [42]:
print("Last 5 rows")
csvdata.tail(5)

Last 5 rows

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomeID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

### Look at the names of the columns

In [43]:
# lets look at the columns in the dataframe using the columns attribute of the data frame
# accessed with . operator
csvdata.columns
# to assign new column names we can do this csvdata.columns = [colname1,colname2,colname3,...,colnamen]

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomeID', 'Country'],
      dtype='object')

### Access specific column of a data frame
To return single column of a data frame we can pass the name of the column inside the square brackets [  ]. 

If there are more than one column, then we can pass these columns by writing their names inside a list and passing the list directly in place of single column name.

In [44]:
# lets look at the column Quanity in the dataframe
colQuantity = csvdata["Quantity"] # colQuantity.tail(5)
newcolquantity = csvdata.Quantity # another method
print(type(colQuantity))
print(colQuantity.head(5))
print(type(newcolquantity))
print(newcolquantity.head(5))

<class 'pandas.core.series.Series'>
0    6
1    6
2    8
3    6
4    6
Name: Quantity, dtype: int64
<class 'pandas.core.series.Series'>
0    6
1    6
2    8
3    6
4    6
Name: Quantity, dtype: int64

#### Understand the frequencies across different categories for specific variable
We can use the syntax ***data_name.column_name.value_counts()***

In [5]:
tmpdf = csvdata['InvoiceNo'].value_counts(dropna=True,ascending=True).reset_index()

In [6]:
tmpdf.rename({"index":"InvoiceNo","InvoiceNo":"Count"},axis = 'columns',inplace=True)

In [7]:
tmpdf

      InvoiceNo  Count
0        561490      1
1        580704      1
2        561062      1
3        576691      1
4       C557965      1
...         ...    ...
25895    558475    705
25896    580729    721
25897    581492    731
25898    581219    749
25899    573585   1114

[25900 rows x 2 columns]

In [12]:
colQuanityUnitPrice =  csvdata[["Quantity","UnitPrice"]]
colQuanityUnitPrice.head(2)

   Quantity  UnitPrice
0         6       2.55
1         6       3.39

### Selecting specific columns and rows
The method of selecting specific rows and columns based on index or boolean condition is called slicing. In this section we look at these two approaches separately using two specific methods meant for each purpose respectively.

##### Index based slicing
The ***iloc indexer*** for Pandas Dataframe is used for integer-location based indexing / selection by position.

The iloc indexer syntax is ***data.iloc[ row selection , column selection]***. Here, for row selection we can pass a single index or pass a list of indices. To select columns, we can pass single column index or list of column indices. It is okay to not provide the column selector. If we leave either of row or column selector empty then by default all rows or columns get selected.

In [82]:
## Let us select rows from 20 to 40
testdf1 = csvdata.iloc[20:40,2:5]
print(testdf1)
## Let us select quantity and Country with index 3 and 7 from testdf1 
testdf2 = csvdata.iloc[:,[1,2]] # or we could do testdf1[["Quantity","Country"]]
print("\n\n",testdf2)

           InvoiceDate  UnitPrice CustomeID         Country
20 2010-12-01 08:34:00       7.95   13047.0  United Kingdom
21 2010-12-01 08:34:00       4.25   13047.0  United Kingdom
22 2010-12-01 08:34:00       4.95   13047.0  United Kingdom
23 2010-12-01 08:34:00       4.95   13047.0  United Kingdom
24 2010-12-01 08:34:00       4.95   13047.0  United Kingdom
25 2010-12-01 08:35:00       5.95   13047.0  United Kingdom
26 2010-12-01 08:45:00       3.75   12583.0          France
27 2010-12-01 08:45:00       3.75   12583.0          France
28 2010-12-01 08:45:00       3.75   12583.0          France
29 2010-12-01 08:45:00       0.85   12583.0          France
30 2010-12-01 08:45:00       0.65   12583.0          France
31 2010-12-01 08:45:00       0.85   12583.0          France
32 2010-12-01 08:45:00       1.25   12583.0          France
33 2010-12-01 08:45:00       2.95   12583.0          France
34 2010-12-01 08:45:00       2.95   12583.0          France
35 2010-12-01 08:45:00       1.95   12583.0          France
36 2010-12-01 08:45:00       1.95   12583.0          France
37 2010-12-01 08:45:00       1.95   12583.0          France
38 2010-12-01 08:45:00       0.85   12583.0          France
39 2010-12-01 08:45:00       1.65   12583.0          France


        StockCode                          Description
0         85123A   WHITE HANGING HEART T-LIGHT HOLDER
1          71053                  WHITE METAL LANTERN
2         84406B       CREAM CUPID HEARTS COAT HANGER
3         84029G  KNITTED UNION FLAG HOT WATER BOTTLE
4         84029E       RED WOOLLY HOTTIE WHITE HEART.
...          ...                                  ...
541904     22613          PACK OF 20 SPACEBOY NAPKINS
541905     22899         CHILDREN'S APRON DOLLY GIRL
541906     23254        CHILDRENS CUTLERY DOLLY GIRL
541907     23255      CHILDRENS CUTLERY CIRCUS PARADE
541908     22138        BAKING SET 9 PIECE RETROSPOT

[541909 rows x 2 columns]

##### Indexing based on labels or boolean condition
When we want to use the column names instead of index or boolean expression for rows or row labels then we use the loc method instead of iloc. It has the same structure ***data.loc[row selection, column selection].*** The rows and columns can be given as a list or rows could be given as a boolean expression. When we provide multiple boolean expression we need to make sure each is enclosed inside () and separated by 

***'&'*** for and 

***'|'*** for or 

***'~'*** for not

Selection of columns is optional

In [90]:
csvdata.query("Country =='France' and Quantity>20 and Quantity <30")

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomeID,Country
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,2010-12-01 08:45:00,3.75,12583.0,France
27,536370,22727,ALARM CLOCK BAKELIKE RED,24,2010-12-01 08:45:00,3.75,12583.0,France
30,536370,21883,STARS GIFT TAPE,24,2010-12-01 08:45:00,0.65,12583.0,France
32,536370,21791,VINTAGE HEADS AND TAILS CARD GAME,24,2010-12-01 08:45:00,1.25,12583.0,France
34,536370,22326,ROUND SNACK BOXES SET OF4 WOODLAND,24,2010-12-01 08:45:00,2.95,12583.0,France
...,...,...,...,...,...,...,...,...
532697,580986,22752,SET 7 BABUSHKA NESTING BOXES,24,2011-12-06 16:34:00,3.95,12650.0,France
532922,581001,23084,RABBIT NIGHT LIGHT,24,2011-12-07 08:07:00,1.79,12583.0,France
532936,581001,22726,ALARM CLOCK BAKELIKE GREEN,24,2011-12-07 08:07:00,3.75,12583.0,France
534786,581171,22966,GINGERBREAD MAN COOKIE CUTTER,24,2011-12-07 15:02:00,1.25,12615.0,France
534804,581171,23084,RABBIT NIGHT LIGHT,24,2011-12-07 15:02:00,1.79,12615.0,France

In [15]:
testdf1 = csvdata.loc[csvdata['Country']=='France',['InvoiceNo','Description',"UnitPrice","Quantity"]]
print("testdf1 is")
print(testdf1.head(5))
print("\nshape of testdf1 is")
print(testdf1.shape)
testdf2 = csvdata.loc[(csvdata['Country']=='France') & (csvdata["Quantity"] >= 20),\
                     ['InvoiceNo','Description',"UnitPrice","Quantity"]]
print("\ntestdf2 is ")
print(testdf2.head(5))
print("\ntestdf2 shape is")
print(testdf2.shape)
# we can also pass conditions as df[(condition1) & (condition2)] when we want to get all colums
# without using loc or iloc

testdf1 is
   InvoiceNo                      Description  UnitPrice  Quantity
26    536370        ALARM CLOCK BAKELIKE PINK       3.75        24
27    536370        ALARM CLOCK BAKELIKE RED        3.75        24
28    536370       ALARM CLOCK BAKELIKE GREEN       3.75        12
29    536370  PANDA AND BUNNIES STICKER SHEET       0.85        12
30    536370                 STARS GIFT TAPE        0.65        24

shape of testdf1 is
(8557, 4)

testdf2 is
   InvoiceNo                         Description  UnitPrice  Quantity
26    536370           ALARM CLOCK BAKELIKE PINK       3.75        24
27    536370           ALARM CLOCK BAKELIKE RED        3.75        24
30    536370                    STARS GIFT TAPE        0.65        24
31    536370         INFLATABLE POLITICAL GLOBE        0.85        48
32    536370  VINTAGE HEADS AND TAILS CARD GAME        1.25        24

testdf2 shape is
(1614, 4)

### Assign new columns
We can easily assign new columns to a data frame as follows

In [16]:
# we add new column quantitygood which has true in rows where quanity value is more than average
avgquanity = sum(csvdata.Quantity)/len(csvdata.Quantity)
print(avgquanity)
csvdata["quantitygood"] = csvdata["Quantity"] > avgquanity
csvdata.head(10)

9.55224954743324

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,quantitygood
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom,False
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,False
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom,False
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,False
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom,False
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,12/1/2010 8:26,7.65,17850.0,United Kingdom,False
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,12/1/2010 8:26,4.25,17850.0,United Kingdom,False
7,536366,22633,HAND WARMER UNION JACK,6,12/1/2010 8:28,1.85,17850.0,United Kingdom,False
8,536366,22632,HAND WARMER RED POLKA DOT,6,12/1/2010 8:28,1.85,17850.0,United Kingdom,False
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,12/1/2010 8:34,1.69,13047.0,United Kingdom,True

##### Assigning new column which is based on calculation on other columns

In [17]:
%%time
csvdata["SalesData"] =  csvdata["Quantity"] * csvdata["UnitPrice"]
csvdata.head(5)

Wall time: 131 ms

In [18]:
%%time
## we can also use apply function which is very slow
def getsales(row):
    return row["Quantity"] * row["UnitPrice"]
csvdata["SalesDataduplicate"] =  csvdata.apply(getsales,axis=1) # axis = 1 means apply on each row
print(csvdata.head(5))

  InvoiceNo StockCode                          Description  Quantity  \
0    536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER         6
1    536365     71053                  WHITE METAL LANTERN         6
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER         8
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.         6

      InvoiceDate  UnitPrice  CustomerID         Country  quantitygood  \
0  12/1/2010 8:26       2.55     17850.0  United Kingdom         False
1  12/1/2010 8:26       3.39     17850.0  United Kingdom         False
2  12/1/2010 8:26       2.75     17850.0  United Kingdom         False
3  12/1/2010 8:26       3.39     17850.0  United Kingdom         False
4  12/1/2010 8:26       3.39     17850.0  United Kingdom         False

   SalesData  SalesDataduplicate
0      15.30               15.30
1      20.34               20.34
2      22.00               22.00
3      20.34               20.34
4      20.34               20.34
Wall time: 9.86 s

#### delete specific columns

In [19]:
col = ["SalesDataduplicate"]
print(csvdata.columns)
# will delete columns in col in same data instead of creating a copy
csvdata.drop(columns=col,axis=1,inplace=True) 
print("After deleting columns",csvdata.columns)

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'quantitygood', 'SalesData',
       'SalesDataduplicate'],
      dtype='object')
After deleting columns Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country', 'quantitygood', 'SalesData'],
      dtype='object')

#### convert data type of any column

In [20]:
## we shall convert CustomerID to string type
csvdata["CustomerID"] = csvdata["CustomerID"].astype('str')

## Joining tables
We will look at how table joins work in python. For that we would load two tables. Table one contains information of the user such as age and email. Table two contains information regarding add clicks such as ad ID and clicked or not. We would join these two tables

In [21]:
import numpy as np
userid = [1,2,3]
useremail = ["alice@gmail.com","david@gmail.com","natasha@gmail.com"]
userage = [20,25,30]
userdata = pd.DataFrame(data=np.column_stack([userid,useremail,userage]),columns=["ID","Email","Age"])
userdata

  ID              Email Age
0  1    alice@gmail.com  20
1  2    david@gmail.com  25
2  3  natasha@gmail.com  30

In [22]:
userID = [1,1,1,2,2,2,3,3,3,3,3]
adID = [1,2,5,3,4,1,2,1,3,4,5]
Clickvalues = [1,0,0,0,1,0,0,0,0,0,1]
clkdata=pd.DataFrame(data=np.column_stack([userID,adID,Clickvalues]),columns=["userID","adID","Click"])
clkdata

    userID  adID  Click
0        1     1      1
1        1     2      0
2        1     5      0
3        2     3      0
4        2     4      1
5        2     1      0
6        3     2      0
7        3     1      0
8        3     3      0
9        3     4      0
10       3     5      1

In [23]:
userdata["ID"] = userdata["ID"].astype("str")
clkdata["userID"] = clkdata["userID"].astype("str")
mergedata = pd.merge(left = clkdata,right = userdata, left_on="userID", right_on= "ID")
mergedata.drop(columns=["ID"],inplace=True,axis=1)
mergedata

   userID  adID  Click              Email Age
0       1     1      1    alice@gmail.com  20
1       1     2      0    alice@gmail.com  20
2       1     5      0    alice@gmail.com  20
3       2     3      0    david@gmail.com  25
4       2     4      1    david@gmail.com  25
5       2     1      0    david@gmail.com  25
6       3     2      0  natasha@gmail.com  30
7       3     1      0  natasha@gmail.com  30
8       3     3      0  natasha@gmail.com  30
9       3     4      0  natasha@gmail.com  30
10      3     5      1  natasha@gmail.com  30

#### Converting multiple numerical columns to two specific columns where one denotes the column names and other the corresponding column value

Confused!
Let's us look at the below example and understand it

In [26]:
newdf = pd.melt(frame=mergedata,value_vars=['Click','Age'],id_vars=['userID','adID','Email'])
newdf

   userID  adID              Email variable value
0       1     1    alice@gmail.com    Click     1
1       1     2    alice@gmail.com    Click     0
2       1     5    alice@gmail.com    Click     0
3       2     3    david@gmail.com    Click     0
4       2     4    david@gmail.com    Click     1
5       2     1    david@gmail.com    Click     0
6       3     2  natasha@gmail.com    Click     0
7       3     1  natasha@gmail.com    Click     0
8       3     3  natasha@gmail.com    Click     0
9       3     4  natasha@gmail.com    Click     0
10      3     5  natasha@gmail.com    Click     1
11      1     1    alice@gmail.com      Age    20
12      1     2    alice@gmail.com      Age    20
13      1     5    alice@gmail.com      Age    20
14      2     3    david@gmail.com      Age    25
15      2     4    david@gmail.com      Age    25
16      2     1    david@gmail.com      Age    25
17      3     2  natasha@gmail.com      Age    30
18      3     1  natasha@gmail.com      Age    30
19      3     3  natasha@gmail.com      Age    30
20      3     4  natasha@gmail.com      Age    30
21      3     5  natasha@gmail.com      Age    30